podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA_S32K142.svd.xml
            <register>
               <name>DCHPRI0</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x103</addressOffset>
               <size>8</size>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI7</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x104</addressOffset>
               <size>8</size>
               <resetValue>0x7</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI6</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x105</addressOffset>
               <size>8</size>
               <resetValue>0x6</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI5</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x106</addressOffset>
               <size>8</size>
               <resetValue>0x5</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI4</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x107</addressOffset>
               <size>8</size>
               <resetValue>0x4</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI11</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x108</addressOffset>
               <size>8</size>
               <resetValue>0xB</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI10</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x109</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI9</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x10A</addressOffset>
               <size>8</size>
               <resetValue>0x9</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI8</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x10B</addressOffset>
               <size>8</size>
               <resetValue>0x8</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
