podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA_S32K142.svd.xml
            <register>
               <name>DCHPRI15</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>8</size>
               <resetValue>0xF</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI14</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x10D</addressOffset>
               <size>8</size>
               <resetValue>0xE</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI13</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x10E</addressOffset>
               <size>8</size>
               <resetValue>0xD</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DCHPRI12</name>
               <description>Channel n Priority Register</description>
               <addressOffset>0x10F</addressOffset>
               <size>8</size>
               <resetValue>0xC</resetValue>
               <resetMask>0xCF</resetMask>
               <fields>
                  <field>
                     <name>CHPRI</name>
                     <description>Channel n Arbitration Priority</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>DPA</name>
                     <description>Disable Preempt Ability. This field resets to 0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n can suspend a lower priority channel</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n cannot suspend any channel, regardless of channel priority</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECP</name>
                     <description>Enable Channel Preemption. This field resets to 0</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Channel n cannot be suspended by a higher priority channel&apos;s service request</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Channel n can be temporarily suspended by the service request of a higher priority channel</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>16</dim>
               <dimIncrement>32</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>TCD,@p@a@i_@f</name>
               <addressOffset>0x1000</addressOffset>
               <register>
                  <name>SADDR</name>
                  <description>TCD Source Address</description>
                  <addressOffset>0x0</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SADDR</name>
                        <description>Source Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SOFF</name>
                  <description>TCD Signed Source Address Offset</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SOFF</name>
                        <description>Source address signed offset</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ATTR</name>
                  <description>TCD Transfer Attributes</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DSIZE</name>
                        <description>Destination data transfer size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>DMOD</name>
                        <description>Destination Address Modulo</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>SSIZE</name>
                        <description>Source data transfer size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>8-bit</description>
                              <value>0b000</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>16-bit</description>
                              <value>0b001</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>10</name>
                              <description>32-bit</description>
                              <value>0b010</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMOD</name>
                        <description>Source Address Modulo</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>5</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>Source address modulo feature is disabled</description>
                              <value>0b00000</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLNO</name>
                  <description>TCD Minor Byte Count (Minor Loop Mapping Disabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Minor Byte Transfer Count</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLOFFNO</name>
                  <description>TCD Signed Minor Loop Offset (Minor Loop Mapping Enabled and Offset Disabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Minor Byte Transfer Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>30</bitWidth>
                     </field>
                     <field>
                        <name>DMLOE</name>
                        <description>Destination Minor Loop Offset enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The minor loop offset is not applied to the DADDR</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The minor loop offset is applied to the DADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMLOE</name>
                        <description>Source Minor Loop Offset Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The minor loop offset is not applied to the SADDR</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The minor loop offset is applied to the SADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>NBYTES_MLOFFYES</name>
                  <description>TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Minor Byte Transfer Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>MLOFF</name>
                        <description>If SMLOE or DMLOE is set, this field represents a sign-extended offset applied to the source or destination address to form the next-state value after the minor loop completes</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>20</bitWidth>
                     </field>
                     <field>
                        <name>DMLOE</name>
                        <description>Destination Minor Loop Offset enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The minor loop offset is not applied to the DADDR</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The minor loop offset is applied to the DADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMLOE</name>
                        <description>Source Minor Loop Offset Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The minor loop offset is not applied to the SADDR</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The minor loop offset is applied to the SADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SLAST</name>
                  <description>TCD Last Source Address Adjustment</description>
                  <addressOffset>0xC</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SLAST</name>
                        <description>Last Source Address Adjustment</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADDR</name>
                  <description>TCD Destination Address</description>
                  <addressOffset>0x10</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DADDR</name>
                        <description>Destination Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DOFF</name>
                  <description>TCD Signed Destination Address Offset</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DOFF</name>
                        <description>Destination Address Signed Offset</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CITER_ELINKNO</name>
                  <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>CITER</name>
                        <description>Current Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enable channel-to-channel linking on minor-loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0</name>
                              <description>The channel-to-channel linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>1</name>
                              <description>The channel-to-channel linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
